SvetlAl/STM32_LIN_FDCAN_TOOL/stm32/Keil/105_205_template/Core/src/stm32f105_usbdfs_cdc.c
/****************************************************************
* STM32F105
* USB OTG FS device (CDC) implementation
*
* Alex Svetlichnyy 2021 svetlal@outlook.com
*****************************************************************/

#include <stm32f105_usbdfs_cdc.h>
#include <stm32f105_usbdfs_macros.h>
#include "usb_cdc_desc.h"



/****************************************************************
 * 		RX buffers for Endpoint structure
 * 		May be customized or exluded
*****************************************************************/

#define RX_BUFFER_EP0_SIZE 8U 										/* Enough to set linecoding */
#define RX_BUFFER_EP1_SIZE 128U

static uint8_t rxBufferEp0[RX_BUFFER_EP0_SIZE]; /* Recieved data is stored here after application reads DFIFO. RX FIFO is shared */
static uint8_t rxBufferEp1[RX_BUFFER_EP1_SIZE]; /* Recieved data is stored here after application reads DFIFO. RX FIFO is shared */

/****************************************************************
 * 		LineCoding
 * 		The application has to set linecoding
 * 		according to host requests
*****************************************************************/

static uint8_t lineCoding[CDC_LINE_CODING_LENGTH]={
	0x00, 
	0x00,	/* 0x01, */
	0x00, /* 0xC2, */
	0x00, /* 0X0001C200 -= 115200 Kb/s */
	0x00,
	0x00,
	0x00	/* 0x08 */
};


static uint32_t device_state = DEVICE_STATE_DEFAULT; /* Device state */
uint32_t getdevstat(){ return device_state;}

EndPointStruct EndPoint[EP_COUNT];	/* All the Enpoints are included in this array */

static USB_setup_req_data setup_pkt_data; /* Setup Packet var */

/****************************************************************
 * 		static functions' declarations
*****************************************************************/

/* Device state */
static inline void set_device_status(eDeviceState state);


/* FIFO handlers */
static inline uint32_t DTFXSTS_timeout(uint8_t Epnum, uint32_t dtxfsts_val);

static inline uint32_t check_free_space_inFifo(uint8_t dfifo, uint32_t space);

static inline uint32_t is_epena_stuck(uint8_t EPnum);

static inline uint32_t recovery_routine_EP_IN (uint8_t EPnum);

/* Init EP */
static void initEndPoints(void);

static inline void set_FIFOs_sz(void);

/* EP routine */
static inline uint32_t is_tx_ep_fifo_ready(uint8_t EPnum, uint32_t param);

static inline void toggle_Rx_EP_Status(uint8_t EPnum, uint8_t param);

static uint32_t send_zlp(uint8_t EPnum);


/***************************************************
*
* 		Circular buffer example
* 		Customize it in the way you need
*
***************************************************/
#ifdef USB_CDC_CIRC_BUF_USED

static uint8_t circBufferTx[CIRC_BUFFER_TX_SIZE];
static uint16_t writePtrTxCbuf = 0U;
static uint16_t readPtrTxCbuf = 0U;


static inline uint32_t is_circBuffer_empty(){
	if(writePtrTxCbuf == readPtrTxCbuf) return 0;
	else return 1;
}

static inline uint32_t get_circBuffer_freeSize(){
	if(is_circBuffer_empty() ==0) return CIRC_BUFFER_TX_SIZE;
	uint32_t gap = (writePtrTxCbuf > readPtrTxCbuf) ? (uint32_t)(writePtrTxCbuf - readPtrTxCbuf) : (uint32_t)(readPtrTxCbuf - writePtrTxCbuf);

	uint32_t freeSz = (writePtrTxCbuf > readPtrTxCbuf) ? CIRC_BUFFER_TX_SIZE - gap : CIRC_BUFFER_TX_SIZE - gap;
	return freeSz;
}


void write_to_circBuffer(uint8_t *buf, uint16_t len){
	
	if((writePtrTxCbuf + len) >= CIRC_BUFFER_TX_SIZE){
		uint32_t write_tail = (uint32_t)((CIRC_BUFFER_TX_SIZE) - writePtrTxCbuf);
		memcpy(&circBufferTx[writePtrTxCbuf], buf, write_tail);
		memcpy(&circBufferTx[0], (buf+write_tail), (len - write_tail));		
		writePtrTxCbuf =  (uint16_t)((writePtrTxCbuf + len) - (uint16_t)CIRC_BUFFER_TX_SIZE);
	}
	else{
		memcpy(&circBufferTx[writePtrTxCbuf], buf, len);		
		writePtrTxCbuf = (uint16_t)(writePtrTxCbuf + len);
	}
}

/**
* brief  Get a string from the Circular buffer
* param  Maximum length to get. For Example, if len=256, the function returns 256 length string index, if used space > 256.
* param  If used space < 256, the function returns used space.
* retval First character's index and length
*/
static circBufferAddress read_circBuffer(uint16_t len){
	circBufferAddress result;
	if(is_circBuffer_empty() == 0){
		result.index = 0;
		result.len = 0;
		return result;
	}
	uint16_t writtenSize = (uint16_t)(CIRC_BUFFER_TX_SIZE - get_circBuffer_freeSize());
	len = (writtenSize > len) ? len : writtenSize;
	result.index = readPtrTxCbuf;
	
	if((readPtrTxCbuf + len) >= (CIRC_BUFFER_TX_SIZE)){
		uint16_t read_tail = (uint16_t)((CIRC_BUFFER_TX_SIZE) - readPtrTxCbuf);
		result.len = read_tail;
		readPtrTxCbuf = 0;		
	}
	else{
		uint16_t read_tail = len;
		result.len = read_tail;
		readPtrTxCbuf = (uint16_t)(readPtrTxCbuf + len);
	}
	return result;
}
#endif

/***************************************************
*
* 	Initialization functions
*
***************************************************/

/**
* brief  fill endpoint structures with initial data
* param  
* param 
* retval 
*/
static void initEndPoints(){
	for(uint32_t i = 0; i < EP_COUNT; i++){
		EndPoint[i].statusRx = EP_READY;
		EndPoint[i].statusTx = EP_READY;
		EndPoint[i].rxCounter = 0;
		EndPoint[i].txCounter = 0;
	//	EndPoint[i].errCode = 0;
		EndPoint[i].setTxBuffer = &USB_CDC_setTxBuffer;
		EndPoint[i].txCallBack = &USB_CDC_transferTXCallback;
				
		/* EndPoint 0 */
		if(i==0){
			EndPoint[i].rxBuffer_ptr = rxBufferEp0;  /* RX Buffer for EP0 */
			EndPoint[i].rxCallBack = &USB_CDC_transferRXCallback_EP0;
		}
		/* EndPoint 1 */
		else if(i==1){
			EndPoint[i].rxBuffer_ptr = rxBufferEp1;	/* RX Buffer for EP1 */
			EndPoint[i].rxCallBack = &USB_CDC_transferRXCallback_EP1;
		}
		else{
			EndPoint[i].rxBuffer_ptr = 0; /* TODO add EP2 support */
		}
	}	
}

/**
* brief  Set RX and TX FIFO size and offset for each EP
* param
* param
* retval
*/
static inline void set_FIFOs_sz(){
	USB_OTG_FS->GRXFSIZ = RX_FIFO_SIZE; /* all EPs RX FIFO RAM size */
	USB_OTG_FS->DIEPTXF0_HNPTXFSIZ = ((TX_EP0_FIFO_SIZE) << 16) | RX_FIFO_SIZE; /* EP0 TX FIFO RAM size */
	USB_OTG_FS->DIEPTXF[0] = ((TX_EP1_FIFO_SIZE) << 16) | (RX_FIFO_SIZE+TX_EP0_FIFO_SIZE); /* EP1 TX FIFO RAM size */
//	USB_OTG_FS->DIEPTXF[1] = ((TX_EP2_FIFO_SIZE) << 16) | (RX_FIFO_SIZE+TX_EP0_FIFO_SIZE+TX_EP1_FIFO_SIZE); 				/* EP2 TX FIFO RAM size */
//	USB_OTG_FS->DIEPTXF[2] = ((TX_EP3_FIFO_SIZE) << 16) | (RX_FIFO_SIZE+TX_EP0_FIFO_SIZE+TX_EP1_FIFO_SIZE+TX_EP2_FIFO_SIZE); /* EP3 TX FIFO RAM size */

	for(uint32_t i = 1; i < 0x10 ; i++){
		USB_OTG_FS->DIEPTXF[i] = 0;
	}
}

/**
* brief  Init GPIO to use USB OTG for stm32f205/207
* param
* param
* retval
* A11 and A12
*/
void USB_OTG_FS_init_pinout(){
	#ifdef STM32F205
	GPIOA->MODER &= ~GPIO_MODER_MODER11;
	GPIOA->MODER |= GPIO_MODER_MODER11_1;
	GPIOA->OSPEEDR &= ~GPIO_OSPEEDR_OSPEED11;
	GPIOA->OSPEEDR |= GPIO_OSPEEDR_OSPEED11;
	GPIOA->PUPDR &= ~GPIO_PUPDR_PUPD11;
	GPIOA->AFR[1] |= GPIO_AFRH_AFSEL11_1;
	GPIOA->AFR[1] |= GPIO_AFRH_AFSEL11_3;
	
	GPIOA->MODER &= ~GPIO_MODER_MODER12;
	GPIOA->MODER |= GPIO_MODER_MODER12_1;
	GPIOA->OSPEEDR &= ~GPIO_OSPEEDR_OSPEED12;
	GPIOA->OSPEEDR |= GPIO_OSPEEDR_OSPEED12;
	GPIOA->PUPDR &= ~GPIO_PUPDR_PUPD12;
	GPIOA->AFR[1] |= GPIO_AFRH_AFSEL12_1;
	GPIOA->AFR[1] |= GPIO_AFRH_AFSEL12_3;
	#endif
	
	#ifdef STM32F105
	GPIOA->CRH	&= ~GPIO_CRH_CNF11;
	GPIOA->CRH	|=  GPIO_CRH_CNF11_0;
	GPIOA->CRH 	&= ~GPIO_CRH_MODE11_0;

	GPIOA->CRH	&= ~GPIO_CRH_CNF12;
	GPIOA->CRH	|=  GPIO_CRH_CNF12_0;
	GPIOA->CRH 	&= ~GPIO_CRH_MODE12_0;
	#endif
}

/**
* brief  Init general settings of USB_OTG periph
* param
* param
* retval
*/
void USB_OTG_FS_init_device(){
	device_state = DEVICE_STATE_DEFAULT;
	USB_OTG_FS->GAHBCFG = USB_OTG_GAHBCFG_GINT; /* Enable Global Interrupt */
//	USB_OTG_FS->GAHBCFG |= USB_OTG_GAHBCFG_TXFELVL;
//	USB_OTG_FS->GAHBCFG |= USB_OTG_GAHBCFG_PTXFELVL;

	USB_OTG_FS->GINTMSK = USB_OTG_GINTMSK_USBRST |
										//		USB_OTG_GINTMSK_ENUMDNEM |
												USB_OTG_GINTMSK_SOFM   |
												USB_OTG_GINTMSK_OEPINT |
												USB_OTG_GINTMSK_IEPINT |
												USB_OTG_GINTSTS_RXFLVL;
	
	/* Enable Global Interrupt for Reset, IN, OUT, RX not empty */

