SvetlAl/STM32_LIN_FDCAN_TOOL/stm32/Keil/105_205_template/Core/src/stm32f105_usbdfs_cdc.c
	/* TEC */
	#ifdef STM32F205
	USB_OTG_FS->GCCFG = USB_OTG_GCCFG_PWRDWN | USB_OTG_GCCFG_NOVBUSSENS; /* Power up */
	#endif
	#ifdef STM32F105
	USB_OTG_FS->GCCFG = USB_OTG_GCCFG_PWRDWN  | USB_OTG_GCCFG_VBUSBSEN; /* Power up */
	#endif
	
	USB_OTG_DEVICE->DCTL = USB_OTG_DCTL_SDIS;  /* Soft disconnect */
	USB_OTG_PCGCCTL->PCGCCTL = 0;
	USB_OTG_FS->GUSBCFG =  USB_OTG_GUSBCFG_FDMOD | USB_OTG_GUSBCFG_PHYSEL; /* Force device mode */
	USB_OTG_FS->GUSBCFG &= ~(uint32_t)(0x0FUL << 10UL) ;  /* USB turnaround time (according to AHB and ReferenceManual) */
	USB_OTG_FS->GUSBCFG |= (0x6 << 10);

	set_FIFOs_sz();
	/* Init  EP0: 1 Packet, 3*8 bytes */
	USB_EP_OUT(0)->DOEPTSIZ = 0;
	USB_EP_OUT(0)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_PKTCNT & (1 << 19)); /* This field is decremented to zero after a packet is written into the RxFIFO */
	USB_EP_OUT(0)->DOEPTSIZ |= USB_CDC_MAX_PACKET_SIZE; /* Set in descriptor  */
	USB_EP_OUT(0)->DOEPTSIZ |= USB_OTG_DOEPTSIZ_STUPCNT;  /* STUPCNT==0x11 means, EP can recieve 3 packets. RM says to set STUPCNT = 3*/
	USB_EP_OUT(0)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA); /* Clear NAK and enable EP0 */

	USB_OTG_DEVICE->DCFG |= USB_OTG_DCFG_DSPD_Msk;  /* Device speed - FS */
	USB_OTG_FS->GINTSTS = 0xFFFFFFFF; /* Reset Global Interrupt status */
	USB_OTG_DEVICE->DCTL &= ~USB_OTG_DCTL_SDIS;   /* Soft connect */
	initEndPoints();
	

	NVIC_SetPriority(OTG_FS_IRQn, 5);
	NVIC_EnableIRQ(OTG_FS_IRQn);
}

/***************************************************
*
* 	Miscellaneous service functions
*
***************************************************/
/**
* brief  Send Zero Length Packet
* param
* param
* retval OK/FAILED
*/

static uint32_t send_zlp(uint8_t EPnum){
	USB_EP_IN(EPnum)->DIEPTSIZ = 0;
	USB_EP_IN(EPnum)->DIEPTSIZ = ((USB_OTG_DIEPTSIZ_PKTCNT_Msk & ((1) << USB_OTG_DIEPTSIZ_PKTCNT_Pos))); /* One Packet */
	USB_EP_IN(EPnum)->DIEPTSIZ &= ~USB_OTG_DIEPTSIZ_XFRSIZ_Msk;  /* Zero Length */
	USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;

	while(USB_EP_IN(EPnum)->DIEPTSIZ!=0){} /* make sure zlp is gone */

	USB_EP_OUT(EPnum)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
	clear_USB_device_status(DEVICE_STATE_TX_PR);

	EndPoint[EPnum].statusTx = EP_READY;
	USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;

	if(is_epena_stuck(EPnum) == EP_OK){
		return EP_OK;
	}
	else return EP_FAILED;
}

 /**
 * brief  Flush TxFifo
 * param  Fifo number, 10 = all Tx Fifos,
 * param  timeout (default FLUSH_FIFO_TIMEOUT)
 * retval 1 = OK, 0 = Failed
 */
uint32_t USB_FlushTxFifo(uint32_t EPnum, uint32_t timeout){
	uint32_t count = 0;
	USB_OTG_FS->GRSTCTL = (USB_OTG_GRSTCTL_TXFFLSH | (EPnum << 6));
	do{
		if (++count > timeout){
			return EP_FAILED;
		}
	}
	while ((USB_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_TXFFLSH) == USB_OTG_GRSTCTL_TXFFLSH);

   return EP_OK;
}

 /**
 * brief  Flush RxFifo
 * param  timeout (default FLUSH_FIFO_TIMEOUT)
 * param
 * retval 1 = OK, 0 = Failed
 */
uint32_t USB_FlushRxFifo(uint32_t timeout){
	uint32_t count = 0;
	USB_OTG_FS->GRSTCTL = USB_OTG_GRSTCTL_RXFFLSH;
	do{
		if (++count > timeout){
			return EP_FAILED;
		}
	}
	while ((USB_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_RXFFLSH) == USB_OTG_GRSTCTL_RXFFLSH);

	return EP_OK;
}


 /**
 * brief  Change EP OUT status
 * brief
 * param  EP number
 * param  READY/BUSY
 * retval
 */

static inline void toggle_Rx_EP_Status(uint8_t EPnum, uint8_t param){
	if(EndPoint[EPnum].statusRx == param) return;
 	EndPoint[EPnum].statusRx = param; /* toggle status*/

	if(param==EP_READY){
		USB_EP_OUT(EPnum)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
 	}
		else{
			USB_EP_OUT(EPnum)->DOEPCTL |= USB_OTG_DOEPCTL_SNAK;
		}
}


/***************************************************
*
* 		DFIFO read/write
*
***************************************************/
/**
* brief  Read Setup Packet EP0
* param  
* param 
* retval 
*/
void read_Setup_Fifo(){
	/* Read Setup packet. Always 8 bytes */
	setup_pkt_data.raw_data[0] = USB_OTG_DFIFO(0);
	setup_pkt_data.raw_data[1] = USB_OTG_DFIFO(0);
}
	
/**
* brief  Read data from DFIFO (into rxBufferMain[RX_BUFFER_MAIN_SIZE] for EP1)
* brief  If you don't handle recieved data on OEPINT event, there is a risk that the data will be lost
* param  EP number, length
* param 
* retval 
*/
void read_Fifo(uint8_t dfifo, uint16_t len){
	uint16_t residue = (len%4==0) ? 0 : 1 ;
	uint32_t block_cnt = (uint32_t)((len/4) + residue);
	uint8_t *tmp_ptr = EndPoint[dfifo].rxBuffer_ptr;

	/* If unprocessed data length exceeds Max buffer length, it has to be rewritten */
	if((dfifo == 1) & ((EndPoint[dfifo].rxCounter + len) > RX_BUFFER_EP1_SIZE)){
		EndPoint[dfifo].rxBuffer_ptr = rxBufferEp1;
		EndPoint[dfifo].rxCounter = 0;
	}
	/********************************************************************************/
	
	for (uint32_t i = 0; i < block_cnt; i++){
		*(uint32_t *)(void *)EndPoint[dfifo].rxBuffer_ptr = USB_OTG_DFIFO(0);
		EndPoint[dfifo].rxBuffer_ptr = EndPoint[dfifo].rxBuffer_ptr + 4;
	}

	if(dfifo!=0){	
		USB_EP_OUT(dfifo)->DOEPTSIZ = 0;			
		USB_EP_OUT(dfifo)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_PKTCNT & (DOEPT_TRANSFER_PCT << USB_OTG_DOEPTSIZ_PKTCNT_Pos)); 
		USB_EP_OUT(dfifo)->DOEPTSIZ |= DOEPT_TRANSFER_SIZE; 
		USB_EP_OUT(dfifo)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
	}
	
	EndPoint[dfifo].rxBuffer_ptr = tmp_ptr + len;
	EndPoint[dfifo].rxCounter = (uint16_t)(EndPoint[dfifo].rxCounter + len);
}


/**
* brief  Write data into DFIFO
* param  EP number, TX Buffer, length 
* param 
* retval OK or FAILED (in case DFIFO overrun, for better details watch my youtube)
*/
uint32_t write_Fifo(uint8_t dfifo, uint8_t *src, uint16_t len){ 

	uint16_t residue = (len%4==0) ? 0 : 1;
	uint32_t block_cnt = (uint32_t)((len/4) + residue);
	uint32_t dtxfsts_sample = USB_EP_IN(dfifo)->DTXFSTS;
		
	for (uint32_t i = 0; (i < block_cnt) ; i++){
		USB_OTG_DFIFO(dfifo) = *((uint32_t *)(void *)src);
		src+=4;	
	} 

