SvetlAl/STM32_LIN_FDCAN_TOOL/stm32/Keil/105_205_template/Core/src/stm32f105_usbdfs_cdc.c
	if(DTFXSTS_timeout(dfifo, dtxfsts_sample)==EP_OK){
		EndPoint[dfifo].txBuffer_ptr = EndPoint[dfifo].txBuffer_ptr + len;
		EndPoint[dfifo].txCounter = (uint16_t)(EndPoint[dfifo].txCounter - len);
		
		return EP_OK;	
	}
	
	else {
		return EP_FAILED;
	} 
}


/***************************************************
*
* 		EndPoints' Callbacks
*
***************************************************/

/**
* brief  Continue TX transaction for a certain EP
* brief  check Endpoint TX status 
* param  EP number
* param 
* retval 
*/
uint32_t USB_CDC_transferTXCallback(uint8_t EPnum){ 
	
	if(EndPoint[EPnum].statusTx == EP_BUSY){
		USB_EP_OUT(EPnum)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);	
		return EP_FAILED;
	}
	/************** EP is ready *****************/	
	/* No data in TX Buffer */
	if(EndPoint[EPnum].txCounter==0){
		if(EndPoint[EPnum].statusTx == EP_ZLP){			
			if(send_zlp(EPnum) == EP_OK){
				return EP_OK;
			}
			else return EP_FAILED;
		}
		USB_EP_OUT(EPnum)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);	
		clear_USB_device_status(DEVICE_STATE_TX_PR);			
		EndPoint[EPnum].statusTx = EP_READY;
		USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;
		return EP_OK;
	}
	
	/************** Calculate packet(s) count *****************/
	uint16_t max_tx_sz; // max transfer size considering TX FIFO size
	if(EPnum==0){
		max_tx_sz = MAX_CDC_EP0_TX_SIZ;
	}
	else max_tx_sz = MAX_CDC_EP1_TX_SIZ;
	
	/* if FIFO size is 64 bytes, but transaction is 67 bytes (DevDescriptor)
	transaction would be split into two parts:
	first one : with 64 bytes length
	second one : with 3 bytes length */
	uint32_t len;
	uint32_t residue;
	uint32_t pct_cnt;
		
	if(EndPoint[EPnum].txCounter < USB_CDC_MAX_PACKET_SIZE){
		len = EndPoint[EPnum].txCounter;
		residue = 0;
		pct_cnt = 1;
	}
	else{
		len = (EndPoint[EPnum].txCounter > max_tx_sz) ? max_tx_sz : EndPoint[EPnum].txCounter ; 
		residue = ((len % USB_CDC_MAX_PACKET_SIZE)==0) ? 0 : 1 ;
		pct_cnt = (uint32_t)((len/USB_CDC_MAX_PACKET_SIZE) + residue);
	}

	/************** Set Busy flag and start transmission *****************/

	EndPoint[EPnum].statusTx = EP_BUSY;	

	/************** data >= USB_CDC_MAX_PACKET_SIZE *****************/

	if(EndPoint[EPnum].txCounter >= USB_CDC_MAX_PACKET_SIZE){  /* counter >= 64 */
	
		USB_EP_IN(EPnum)->DIEPTSIZ = ((USB_OTG_DIEPTSIZ_PKTCNT_Msk & ((pct_cnt) << USB_OTG_DIEPTSIZ_PKTCNT_Pos))) /* One Packet */
		| ((USB_OTG_DIEPTSIZ_XFRSIZ_Msk & ((len) << USB_OTG_DIEPTSIZ_XFRSIZ_Pos)));			/* Max Size */
		USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;
		
		while(write_Fifo(EPnum, EndPoint[EPnum].txBuffer_ptr, (uint16_t)len) == EP_FAILED ){
		
			recovery_routine_EP_IN(EPnum); 
			USB_EP_IN(EPnum)->DIEPTSIZ = 0;
			USB_EP_IN(EPnum)->DIEPTSIZ = ((USB_OTG_DIEPTSIZ_PKTCNT_Msk & ((pct_cnt) << USB_OTG_DIEPTSIZ_PKTCNT_Pos))) /* One Packet */
			| ((USB_OTG_DIEPTSIZ_XFRSIZ_Msk & ((len) << USB_OTG_DIEPTSIZ_XFRSIZ_Pos)));			/* Max Size */
			USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;
			
			if((EPnum == 1) & check_free_space_inFifo(EPnum, EP1_MIN_DTFXSTS_LVL)){
				USB_FlushTxFifo(1, FLUSH_FIFO_TIMEOUT);
			}
		}			
		USB_FlushTxFifo(1, FLUSH_FIFO_TIMEOUT);  //TODO delete

		if(EndPoint[EPnum].txCounter==0 && residue == 0){ /* was this packet of MaxSize the last one in the queue ? ZLP required? */
			EndPoint[EPnum].statusTx = EP_ZLP; /* change EP TX status to ZLP, thereafter ZLP will be sent in sequential function call */
			while(is_epena_stuck(EPnum) != EP_OK){}
			send_zlp(EPnum);
			return EP_OK;
		}
	}
	/************** data <  USB_CDC_MAX_PACKET_SIZE *****************/

	else if(EndPoint[EPnum].txCounter < USB_CDC_MAX_PACKET_SIZE){
	
		USB_EP_IN(EPnum)->DIEPTSIZ = ((USB_OTG_DIEPTSIZ_PKTCNT_Msk & ((1) << USB_OTG_DIEPTSIZ_PKTCNT_Pos))) /* One Packet */
		| ((USB_OTG_DIEPTSIZ_XFRSIZ_Msk & ((uint32_t)(EndPoint[EPnum].txCounter) << USB_OTG_DIEPTSIZ_XFRSIZ_Pos)));	/*  Size */
		USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;

		while(write_Fifo(EPnum, EndPoint[EPnum].txBuffer_ptr, (uint16_t)len) == EP_FAILED ){
			recovery_routine_EP_IN(EPnum); 
			USB_EP_IN(EPnum)->DIEPTSIZ = 0;
			USB_EP_IN(EPnum)->DIEPTSIZ = ((USB_OTG_DIEPTSIZ_PKTCNT_Msk & ((1) << USB_OTG_DIEPTSIZ_PKTCNT_Pos))) /* One Packet */
			| ((USB_OTG_DIEPTSIZ_XFRSIZ_Msk & ((uint32_t)(EndPoint[EPnum].txCounter) << USB_OTG_DIEPTSIZ_XFRSIZ_Pos)));			/* Max Size */
			USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;

			if((EPnum == 1) & check_free_space_inFifo(EPnum, EP1_MIN_DTFXSTS_LVL)){
				USB_FlushTxFifo(1, FLUSH_FIFO_TIMEOUT);
			}
		}			
	//	USB_FlushTxFifo(1, FLUSH_FIFO_TIMEOUT);  //TODO delete
		clear_USB_device_status(DEVICE_STATE_TX_PR);		
	} 
		
	else{
		USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK;		
	}
	/************** finish transmission and set Ready flag  *****************/
	USB_EP_OUT(EPnum)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
	EndPoint[EPnum].statusTx = EP_READY;
	clear_USB_device_status(DEVICE_STATE_TX_PR);
	return EP_OK;
}


/**
* brief  Set and start TX transaction
* param  EP number, TX Buffer, length 
* param 
* retval OK/FAILED
*/
uint32_t USB_CDC_setTxBuffer(uint8_t EPnum, uint8_t *txBuff, uint16_t len){
	/************** Previous transaction is not finished ****************/
	if((EndPoint[EPnum].txCounter != 0) || (EndPoint[EPnum].statusTx == EP_ZLP) || (check_USB_device_status(DEVICE_STATE_TX_PR) == EP_OK)){				
		return EP_FAILED;
	}

	/************** length exceeds max TX size in user settings ****************/
	uint32_t max_transfer_sz;
	if(EPnum == 0){
		max_transfer_sz = MAX_CDC_EP0_TX_SIZ + (USB_CDC_MAX_PACKET_SIZE - 1);
	}
	else max_transfer_sz = MAX_CDC_EP1_TX_SIZ + (USB_CDC_MAX_PACKET_SIZE - 1);
	
	if(len > max_transfer_sz) return EP_FAILED;
	
