SvetlAl/STM32_LIN_FDCAN_TOOL/stm32/Keil/105_205_template/Core/src/stm32f105_usbdfs_cdc.c
	/************** All conditions are OK ****************/
	
	if(len!=0){	/* Set data to send */	
//		USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_SD0PID_SEVNFRM;
		EndPoint[EPnum].txBuffer_ptr = txBuff;
		EndPoint[EPnum].txCounter = len;

		/* Send data */			
		set_device_status(DEVICE_STATE_TX_PR);
		EndPoint[EPnum].txCallBack(EPnum);
		
		return EP_OK;
	}
	
	else{ /* Zero-Length Packet */		
		USB_EP_IN(EPnum)->DIEPTSIZ = 0;
		USB_EP_IN(EPnum)->DIEPTSIZ = ((USB_OTG_DIEPTSIZ_PKTCNT_Msk & ((1) << USB_OTG_DIEPTSIZ_PKTCNT_Pos))); /* One Packet */
		USB_EP_IN(EPnum)->DIEPTSIZ &= ~USB_OTG_DIEPTSIZ_XFRSIZ_Msk;  /* Zero Length */
		USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;
	
		USB_EP_OUT(EPnum)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
		return EP_OK;
	}
}

/**
* brief  Perform some action with recieved data (EP0) and refresh EP buffer counter
* brief  For EP0 - Set lineCoding
* param  command 
* param 
* retval 
*/

uint32_t USB_CDC_transferRXCallback_EP0(uint32_t param){
	uint16_t len = EndPoint[0].rxCounter;	
	if(len==0) return EP_OK;
	if(EndPoint[0].statusRx == EP_BUSY) return EP_FAILED;
	
	if(param == CDC_SET_LINE_CODING){
		
		toggle_Rx_EP_Status(0, EP_BUSY);
		
		uint8_t *data = EndPoint[0].rxBuffer_ptr - EndPoint[0].rxCounter;
		EndPoint[0].rxBuffer_ptr = data;
		uint8_t new_linecoding_settings[CDC_LINE_CODING_LENGTH];  
		
		for(int i = 0; i < len; i++){
			new_linecoding_settings[i] = *data++;
			EndPoint[0].rxCounter--;
		}
			
		// line coding 00 C2 01 00000000 000000000000 08
		for(uint32_t i = 0; i < CDC_LINE_CODING_LENGTH; i++){
			if(i==6 && lineCoding[i]==0x08){lineCoding[i] = 0x08;}
		else
			lineCoding[i] = new_linecoding_settings[i];
		}	
			/* Toggle EP RX status */
		toggle_Rx_EP_Status(0, EP_READY);
	}
	return EP_OK;
}

/*******************************************************************************************************/
/*******************************************************************************************************/
/******************** THIS IS A DEMO HOW TO IMPLEMENT OUT EP + CIRCULAR BUF  ***************************/	
/*******************************************************************************************************/
/*******************************************************************************************************/

/**
* brief  Perform some action with recieved data (EP1) and refresh EP buffer counter
* brief  Test function works as echo and shows number of recieved bytes
* param  a command or a dummy param
* param 
* retval 
*/

__WEAK uint32_t USB_CDC_transferRXCallback_EP1(uint32_t param){
	if(EndPoint[1].statusRx == EP_BUSY) return EP_FAILED;
	/* Toggle EP RX status */
//	toggle_Rx_EP_Status(1, EP_BUSY);
			
	/* CircBufferTest */
 	uint16_t len = EndPoint[1].rxCounter;
	/* CircBufferTest */	
		
/*******************************************************************************************************/
/******** This is a demonstration of both  EndPoint[1].rxCounter ***************************************/	
/******** and circular buffer, for Echo only you don't need to use rxCounter ***************************/	
/******** , you can write in circular buffer you can write directly in write_fifo() function ***********/
/*******************************************************************************************************/	
	
	/* reset RX counter and buffer pointer */
 	EndPoint[1].rxBuffer_ptr -= EndPoint[1].rxCounter;
	EndPoint[1].rxCounter = 0;	
	
	/* CircBufferTest */
 //	write_to_circBuffer(EndPoint[1].rxBuffer_ptr, len);
	/* CircBufferTest */
	USB_CDC_recieve_data(len);

	USB_EP_OUT(1)->DOEPTSIZ = 0;			
	USB_EP_OUT(1)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_PKTCNT & (DOEPT_TRANSFER_PCT << USB_OTG_DOEPTSIZ_PKTCNT_Pos)); 
	USB_EP_OUT(1)->DOEPTSIZ |= DOEPT_TRANSFER_SIZE; 
	USB_EP_OUT(1)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
	
	/* Toggle EP RX status */
//	toggle_Rx_EP_Status(1, EP_READY);

	return param;
}

/***************************************************
*
* 			USB enumeration
*
***************************************************/

/**
* brief  USB reset handler 
* param  
* param 
* retval 
*/

void enumerate_Reset(){
	device_state = DEVICE_STATE_RESET;  
	USB_OTG_FS->GINTSTS &= ~0xFFFFFFFF;
	
	USB_OTG_DEVICE->DAINTMSK = 0x30003;
	 /* Unmask interrupts IEPM, OEPM for EP0, EP1 ,   IEPM for EP2*/
	USB_OTG_DEVICE->DOEPMSK  = USB_OTG_DOEPMSK_STUPM | USB_OTG_DOEPMSK_XFRCM; /* Unmask SETUP Phase done Mask,  TransfeR Completed interrupt for OUT */
	USB_OTG_DEVICE->DIEPMSK  =  /* USB_OTG_DIEPMSK_ITTXFEMSK | */ USB_OTG_DIEPMSK_XFRCM; /* TransfeR Completed interrupt for IN */
    
	/* Flush All Fifos */
//	USB_FlushTxFifo(10, FLUSH_FIFO_TIMEOUT);
//	USB_FlushRxFifo(FLUSH_FIFO_TIMEOUT);
	
	USB_OTG_DEVICE->DCFG  &= ~USB_OTG_DCFG_DAD_Msk;  /* before Enumeration set address 0 */


	/* Endpoint 1 */
	USB_EP_IN(1)->DIEPCTL = USB_OTG_DIEPCTL_SNAK |	
				USB_OTG_DIEPCTL_TXFNUM_0 |  /* TX Number 1 */
				USB_OTG_DIEPCTL_EPTYP_1 |  /* Eptype 10 means Bulk */
				USB_OTG_DIEPCTL_USBAEP |  /* Set Endpoint active */
				USB_CDC_MAX_PACKET_SIZE;  /* Max Packet size (bytes) */ 
	
	USB_EP_OUT(1)->DOEPCTL = USB_OTG_DOEPCTL_EPENA | 	/* Enable Endpoint */
				USB_OTG_DOEPCTL_CNAK |  /* Clear NAK */
				USB_OTG_DOEPCTL_EPTYP_1 |  /* Eptype 10 means Bulk */
				USB_OTG_DOEPCTL_USBAEP | /* Set Endpoint active */
				USB_CDC_MAX_PACKET_SIZE; /* CHK MPSIZ The application must program this field with the maximum packet size for the current logical endpoint. This value is in bytes */

	USB_EP_OUT(1)->DOEPTSIZ = 0;			
	USB_EP_OUT(1)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_PKTCNT & (DOEPT_TRANSFER_PCT << USB_OTG_DOEPTSIZ_PKTCNT_Pos)); /* RM quote: Indicates the total number of USB packets that constitute the Transfer Size amount of data for this endpoint. This field is decremented every time a packet (maximum size or short packet) is written to the RxFIFO */

	USB_EP_OUT(1)->DOEPTSIZ |= DOEPT_TRANSFER_SIZE; /* Transfer size. If you set transfer size = max. packet, the core will interrupt the application at the end of each packet */
	
	/* Endpoint 2 */
	USB_EP_IN(2)->DIEPCTL = USB_OTG_DIEPCTL_SNAK |
				USB_OTG_DIEPCTL_TXFNUM_1 | 
				USB_OTG_DIEPCTL_EPTYP |  // Eptype 11 means Interrupt EP 
				USB_OTG_DIEPCTL_USBAEP | 
				0x08; 
																									
