SvetlAl/STM32_LIN_FDCAN_TOOL/stm32/Keil/105_205_template/Core/src/stm32f105_usbdfs_cdc.c
}

/**
* brief  Handle all host requests, send all descriptors data
* param  
* param 
* retval 
*/
void enumerate_Setup(){
	uint16_t len = setup_pkt_data.setup_pkt.wLength;
	uint8_t dest[128]={0};
			
	switch(setup_pkt_data.setup_pkt.wRequest){
		
		case REQ_TYPE_HOST_TO_DEVICE_GET_DEVICE_DECRIPTOR:
			switch(setup_pkt_data.setup_pkt.wValue){
				case DESCRIPTOR_TYPE_DEVICE: 				/* Request 0x0680  Value 0x0100 */
					if(DEVICE_DESCRIPTOR_LENGTH < len) len = DEVICE_DESCRIPTOR_LENGTH;
					memcpy(&dest, &deviceDescriptor, len);
					break;
				case DESCRIPTOR_TYPE_CONFIGURATION: 			/* Request 0x0680  Value 0x0200 */
					if(CONFIGURATION_DESCRIPTOR_LENGTH < len) len = CONFIGURATION_DESCRIPTOR_LENGTH;
					memcpy(&dest, &configurationDescriptor, len);
					break;    
				case DESCRIPTOR_TYPE_DEVICE_QUALIFIER: 			/* Request 0x0680  Value 0x0600 */
					if(DEVICE_QUALIFIER_LENGTH < len) len = DEVICE_QUALIFIER_LENGTH; 
					memcpy(&dest, &deviceQualifierDescriptor, len);
					//	return; /* CUBE MX CDC actually doesn't send any data here */
					break;          
				case DESCRIPTOR_TYPE_LANG_STRING: 			/* Request 0x0680  Value 0x0300 */
					if(LANG_DESCRIPTOR_LENGTH < len) len = LANG_DESCRIPTOR_LENGTH;   
					memcpy(&dest, &languageStringDescriptor, len);				
					break; 
				case DESCRIPTOR_TYPE_MFC_STRING: 			/* Request 0x0680  Value 0x0301 */
					if(MFC_DESCRIPTOR_LENGTH < len) len = MFC_DESCRIPTOR_LENGTH;
					memcpy(&dest, &manufactorStringDescriptor, len);				
					break;
				case DESCRIPTOR_TYPE_PROD_STRING: 			/* Request 0x0680  Value 0x0302 */
					if(PRODUCT_DESCRIPTOR_LENGTH < len) len = PRODUCT_DESCRIPTOR_LENGTH;
					memcpy(&dest, &productStringDescriptor, len);				
					break;                     
				case DESCRIPTOR_TYPE_SERIAL_STRING: 			/* Request 0x0680  Value 0x0303 */
					if(SERIAL_DESCRIPTOR_LENGTH < len) len = SERIAL_DESCRIPTOR_LENGTH;
					memcpy(&dest, &serialNumberStringDescriptor, len);
					break;
				case DESCRIPTOR_TYPE_CONFIGURATION_STRING: 		/* Request 0x0680  Value 0x0304 */
					if(CONFIG_STRING_LENGTH < len) len = CONFIG_STRING_LENGTH;					
					memcpy(&dest, &configurationStringDescriptor, len);
					break;
				case DESCRIPTOR_TYPE_INTERFACE_STRING: 			/* Request 0x0680  Value 0x0305 */
					if(INTERFACE_STRING_LENGTH < len) len = INTERFACE_STRING_LENGTH;
					memcpy(&dest, &stringInterface, len);
					break;
				default:
					return;
			}
			break;
			
		case REQ_TYPE_DEVICE_TO_HOST_SET_ADDRESS: 				/* Request 0x0500  */
			USB_OTG_DEVICE->DCFG |= (uint32_t)(setup_pkt_data.setup_pkt.wValue << 4);
			set_device_status(DEVICE_STATE_ADDRESSED);
			// device_state = DEVICE_STATE_ADDRESSED;
			break;
		case REQ_TYPE_DEVICE_TO_HOST_SET_CONFIGURATION: 			/* Request 0x0900  */
			len=0; /* ZLP */
			/* TODO: set configuration */
			break;     
		
		case CDC_GET_LINE_CODING: 						/* Request 0x21A1  */
			if(CDC_LINE_CODING_LENGTH < len) len = CDC_LINE_CODING_LENGTH;
			memcpy(&dest, &lineCoding, len);
			set_device_status(DEVICE_STATE_LINECODED);
			break;
		
		case CDC_SET_LINE_CODING: 						/* Request 0x2021  */
			len=0;		
			EndPoint[0].rxCallBack(CDC_SET_LINE_CODING); //TODO
			break;       
		case CDC_SET_CONTROL_LINE_STATE: 					/* Request 0x2221  */
			len=0;	
			break;	
		case CLEAR_FEATURE_ENDP: 						/* Request 0x0201  */
			return;
		default:
			break;
	} 
	
	EndPoint[0].setTxBuffer(0, dest, len);
}


/**
* brief  Schedule a new transmission after a previous one finished
* param  
* param 
* retval EP_FAILED if conditions are not met & (USB_EP_IN(1)->DIEPINT & USB_OTG_DIEPINT_TXFE)
*/

uint32_t USB_CDC_transmit_scheduler(){
#ifdef USB_CDC_CIRC_BUF_USED
//	if(get_circBuffer_freeSize() < (512)){
		//USB_MASK_INTERRUPT(USB_OTG_GINTSTS_RXFLVL); // CHK
		//toggle_Rx_EP_Status(1, EP_BUSY);
//	}
//	else if(get_circBuffer_freeSize() > (512)){
		//USB_UNMASK_INTERRUPT(USB_OTG_GINTSTS_RXFLVL); // CHK
		//toggle_Rx_EP_Status(1, EP_READY);
//	}
	
	if((is_tx_ep_fifo_ready(1, 1) == EP_OK) & (is_circBuffer_empty() !=0 )){

		circBufferAddress newMsgaddr = read_circBuffer(MAX_CDC_EP1_TX_SIZ);
		EndPoint[1].setTxBuffer(1, &circBufferTx[newMsgaddr.index], newMsgaddr.len /*newMsg.len*/);
		return EP_OK;
	}
#endif
	return EP_FAILED; 
}

extern void OTG_FS_IRQHandler(void);
void OTG_FS_IRQHandler(){
	
	/**************************************************************/	
	/****************** Start of Frame event **********************/
	/**************************************************************/
	if(USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_SOF){ 

		USB_CDC_transmit_scheduler();

		USB_CLEAR_INTERRUPT(USB_OTG_GINTSTS_SOF);  	
		return;
	}
	
	/**************************************************************/	
	/****************** ENUMDNEM event ****************************/
	/**************************************************************/
	/*	if(USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_ENUMDNE){  
		USB_CLEAR_INTERRUPT(USB_OTG_GINTSTS_ENUMDNE);   
   		 device_state = DEVICE_STATE_READY;

    		return;
  }*/
	
	/**************************************************************/	
	/****************** USBRST Reset event ************************/
	/**************************************************************/
	if(USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_USBRST){  
		USB_CLEAR_INTERRUPT(USB_OTG_GINTSTS_USBRST);   
		enumerate_Reset();
		return;
	 }
	/**************************************************************/
	/*************** IN endpoint event ****************************/
	/**************************************************************/
	
	if(USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_IEPINT){  /* IN endpoint event */	
		uint32_t epnums  = USB_OTG_DEVICE->DAINT; /* Read out EndPoint INTerrupt bits */

		if(epnums & 0x0001){				/* EndPoint INTerrupt bits correspond to EP0 IN*/
			uint32_t IN_interrupt = USB_EP_IN(0)->DIEPINT; /* Read out EP interrupt bit */

