SvetlAl/STM32_LIN_FDCAN_TOOL/stm32/Keil/105_205_template/Core/src/stm32f105_usbdfs_cdc.c
			if(IN_interrupt & USB_OTG_DIEPINT_XFRC){  /* Transfer completed interrupt. */ 
				EndPoint[0].txCallBack(0);									/* Process TX transmission (if TX buffer is not empty) */
			}
			USB_CLEAR_INTERRUPT(USB_OTG_GINTSTS_IEPINT);	
			CLEAR_IN_EP_INTERRUPT(0, IN_interrupt);
		}

		if( epnums & 0x0002){ /* EndPoint INTerrupt bits correspond to EP1 IN*/
			uint32_t IN_interrupt = USB_EP_IN(1)->DIEPINT;

			if(IN_interrupt & USB_OTG_DIEPINT_XFRC){  /* Transfer completed interrupt.*/ 

				EndPoint[1].txCallBack(1);			/* Process TX transmission (if TX buffer is not empty) */

				USB_CLEAR_INTERRUPT(USB_OTG_GINTSTS_IEPINT);	
				CLEAR_IN_EP_INTERRUPT(1, USB_OTG_DIEPINT_XFRC);			
			}
		}
		return;
	}
	/***************************************************************/
	/*************** OUT endpoint event ****************************/
	/***************************************************************/
	
	if(USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_OEPINT){ /* OUT endpoint event */
		USB_CLEAR_INTERRUPT(USB_OTG_GINTSTS_OEPINT);	
		uint32_t epnums  = USB_OTG_DEVICE->DAINT;    /* Read out EndPoint INTerrupt bits */
		
	/****************** 		EP 0 			*****************************/
		if( epnums & 0x00010000){ /* EndPoint INTerrupt bits correspond to EP0 OUT */  
			uint32_t epint = USB_EP_OUT(0)->DOEPINT; /* Read out Endpoint Interrupt register for EP0 */
						
			if(epint & USB_OTG_DOEPINT_STUP){		/* Setup packet recieved */ 			
				enumerate_Setup();				
				}
			if(epint & USB_OTG_DOEPINT_XFRC){
				EndPoint[0].rxCallBack(0); //TODO
							/* CNAK and EPENA must be set again after every interrupt to let this EP recieve upcoming data */		
				USB_EP_OUT(0)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);	
			}
			CLEAR_OUT_EP_INTERRUPT(0, epint);
		}

	/****************** 		EP 1  			*****************************/		
		if( epnums & 0x00020000){ /* EndPoint INTerrupt bits correspond to EP1 OUT */
			uint32_t epint = USB_EP_OUT(1)->DOEPINT; /* Read out Endpoint Interrupt register for EP0 */
			
			if(epint & USB_OTG_DOEPINT_XFRC){	
												
				EndPoint[1].rxCallBack(EP_OK);	
				/* CNAK and EPENA must be set again after every interrupt to let this EP recieve upcoming data */
				USB_EP_OUT(1)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
				
			}
			CLEAR_OUT_EP_INTERRUPT(1, epint);		
		}   				
		return;
	}

	/***************************************************************/
	/********************* RXFLVL event ****************************/
	/***************************************************************/  
	if(USB_OTG_FS->GINTSTS & USB_OTG_GINTSTS_RXFLVL){ /* RX fifo not empty event */
		uint32_t temp = USB_OTG_FS->GRXSTSP;   /* Read out PacKeT STatuS */ 
		USB_MASK_INTERRUPT(USB_OTG_GINTSTS_RXFLVL); 
		
	/********************* Some data for (EP0, EP1) ****************************/
		if(((temp & USB_OTG_GRXSTSP_PKTSTS) >> 17) ==  STS_DATA_UPDT){ /* 0010: OUT data packet received */ 
		
			if(temp & USB_OTG_GRXSTSP_BCNT){ /* Byte count > 0 ??? */ 
				uint16_t length = ((temp & USB_OTG_GRXSTSP_BCNT) >> USB_OTG_GRXSTSP_BCNT_Pos);
				uint8_t EpNum =	((temp & USB_OTG_GRXSTSP_EPNUM) >> USB_OTG_GRXSTSP_EPNUM_Pos);

				read_Fifo(EpNum, length); /*  Read data from DFIFO  */
			}
		}
		/********************* SETUP PACKET for EP0 ****************************/
		else  if(((temp & USB_OTG_GRXSTSP_PKTSTS) >> 17) ==  STS_SETUP_UPDT){  /* 0110: SETUP data packet received */
			read_Setup_Fifo();
		} 
		USB_UNMASK_INTERRUPT(USB_OTG_GINTSTS_RXFLVL); 
		return;
  }  
}





/************************************************************/
/*************************** inline *************************/
/************************************************************/


/**
* brief  This function is called to ensure that data is written in TX FIFO properly 
* param  EP number, minimum free TX FIFO level
* param  
* retval 
*/
static inline uint32_t DTFXSTS_timeout(uint8_t Epnum, uint32_t dtxfsts_val){
	
	if(Epnum ==0) return EP_OK;

	volatile uint32_t count = 0;
	do{
		if (++count > DTFXSTS_TIMEOUT){
			//return EP_FAILED;
			return EP_FAILED;
		}
	} while (!(USB_EP_IN(Epnum)->DTXFSTS == dtxfsts_val));

	return EP_OK;
}

static inline uint32_t check_free_space_inFifo(uint8_t dfifo, uint32_t space){
	if(USB_EP_IN(dfifo)->DTXFSTS >= space){
		return EP_OK;
	}
	else return EP_FAILED;
}


static inline uint32_t is_epena_stuck(uint8_t EPnum){
	if((USB_EP_IN(EPnum)->DIEPCTL & USB_OTG_DIEPCTL_EPENA)  &  				/* EPENA stuck */
		!(USB_EP_IN(EPnum)->DIEPTSIZ & USB_OTG_DIEPTSIZ_XFRSIZ) &			/* no data pending */
		((USB_EP_IN(EPnum)->DIEPTSIZ & USB_OTG_HCTSIZ_PKTCNT) != 0)){		/* packet count pending */
			
		return EP_FAILED;
	}
	else return EP_OK;
}

/**
* brief  If IN endpoint is busy and some data is stuck in TX FIFO 
* brief  this procedure is called to handle this event
* param  EP number
* param  
* retval 
*/

static inline uint32_t recovery_routine_EP_IN (uint8_t EPnum){
	if((EPnum ==1) & (is_epena_stuck (1) == EP_FAILED)){
		USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_EPDIS;
		USB_EP_IN(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;
		USB_EP_IN(EPnum)->DIEPTSIZ =0;			
		return EP_OK;
	}
	return EP_FAILED;
}
/**
* brief  Device status functions. Set/clear/check
* param  
* param  
* retval 
*/
static inline void set_device_status(eDeviceState state){
	device_state |= state;
}

void clear_USB_device_status(eDeviceState state){
	device_state &= ~(uint32_t)state;
}

uint32_t check_USB_device_status(eDeviceState state){
	if(device_state & state){
		return EP_OK;
	}
	else return EP_FAILED;
}

/**
* brief  Check if TX FIFO is ready to push there data
* param  EP number
* param  param. If you use TX queue, "param" would be message count var pending in the queue
* param  if you have a var like message_counter, you use it here, otherwise use something > 0
* retval 
*/
static inline uint32_t is_tx_ep_fifo_ready(uint8_t EPnum, uint32_t param){
	if((param > 0) & !(device_state & DEVICE_STATE_TX_PR) &
		!(USB_EP_IN(EPnum)->DIEPTSIZ & USB_OTG_DIEPTSIZ_XFRSIZ) &
		((USB_EP_IN(EPnum)->DIEPTSIZ & USB_OTG_HCTSIZ_PKTCNT) == 0) &
		!(USB_EP_IN(EPnum)->DIEPCTL & USB_OTG_DIEPCTL_EPENA)  &
		((USB_EP_IN(EPnum)->DIEPINT & USB_OTG_DIEPINT_TXFE) != 0)){
		
		return EP_OK;
	}
	else return EP_FAILED;
}
/**
* brief  This function monitors SOF messages numbers to see if a "host to device" connection is establiched
* param  
* param 
* param 
* retval OK/FAIL
*/
eLinkState USB_CDC_process_watchdog(){
	if(!(check_USB_device_status(DEVICE_STATE_ADDRESSED))) return LINK_STATE_DEFAULT;
	
	static uint32_t last_usb_frame_watchdog = 0; 
	uint32_t current_usb_frame_watchdog = USB_OTG_DEVICE->DSTS & USB_OTG_DSTS_FNSOF_Msk;
	
	if(current_usb_frame_watchdog != last_usb_frame_watchdog){
		last_usb_frame_watchdog = current_usb_frame_watchdog;
		return LINK_STATE_CONNECTED;
	}
	else{
		clear_USB_device_status(DEVICE_STATE_ADDRESSED);
		return LINK_STATE_DISCONNECTED;
	}
}



/* @TODO update */
uint32_t USB_CDC_send_data(uint8_t *txBuff, uint16_t len){
	if(len==0) return EP_OK;
	
	/* if circular buffer used */
	#ifdef USB_CDC_CIRC_BUF_USED
	if(get_circBuffer_freeSize() < len) return EP_FAILED;
	else{
		write_to_circBuffer(txBuff, len);
		return EP_OK;
	}
	#endif
	
	#ifndef USB_CDC_CIRC_BUF_USED
	/******* DEVICE_STATE_READY ******/
	if(is_tx_ep_fifo_ready(1,1) == EP_OK){
		EndPoint[1].setTxBuffer(1, txBuff, len);
		return EP_OK;
	}
	else return EP_FAILED;
	#endif
}

/* it is recommended to store RX data in a buffer and process the data in a main loop or separated task */
__WEAK uint32_t USB_CDC_recieve_data(uint16_t length){
//	uint8_t *data = EndPoint[1].rxBuffer_ptr;
//	return EP_OK;
	return length;
}
